roboime/STM32-F1-FreeRTOS/Src/main.cpp
void processPacket(){
	//	robo.set_speed(robotcmd.veltangent, robotcmd.velnormal, robotcmd.velangular);
	velocidade_des0=robotcmd.veltangent;
	velocidade_des1=robotcmd.velnormal;
	HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
	//	if(robotcmd.kickspeedx!=0)
	//		robo.ChuteBaixo(robotcmd.kickspeedx);
	//	if(robotcmd.kickspeedz!=0)
	//		robo.HighKick(robotcmd.kickspeedz);
	//	if(robotcmd.spinner)
	//		robo.drible->Set_Vel(660);
	//	else
	//		robo.drible->Set_Vel(0);
}

void interruptReceive(NRF24L01P *_nrf24){
	bool status=0;
	if(_nrf24->RxSize()){
		_nrf24->StartRX_ESB(channel, address + id, 32, 1);
		uint8_t rxsize=_nrf24->RxSize();
		if(rxsize>32) rxsize=32;
		uint8_t buffer[32];
		_nrf24->RxData(buffer, rxsize);
		//usb_device_class_cdc_vcp.SendData((uint8_t*)buffer, rxsize);
		pb_istream_t istream=pb_istream_from_buffer(buffer, rxsize);
		status=pb_decode(&istream, grSim_Robot_Command_fields, &robotcmd);
		last_packet_ms = GetLocalTime();
		controlbit = true;
	}
	if(status){
		if(robotcmd.id==id){
			processPacket();
		}
	}
	if((GetLocalTime()-last_packet_ms)>100){
		controlbit = false;
		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin,GPIO_PIN_RESET);
	}
}


/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
	/* init code for USB_DEVICE */
	MX_USB_DEVICE_Init();

	/* USER CODE BEGIN 5 */
	/* Infinite loop */
	osDelay(2000);

	HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_SET);
	HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_RESET);
	HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_SET);

	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_3);
	HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_4);
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2);

	HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_ALL);
	HAL_TIM_Encoder_Start(&htim4, TIM_CHANNEL_ALL);

	HAL_TIM_Base_Start_IT(&htim1);


	int a=0;

	//Declarações--
	IO_Pin_STM32 nrf_nss(IO_Pin::IO_Pin_Mode_OUT, SPI2_NSS_GPIO_Port, SPI2_NSS_Pin);
	IO_Pin_STM32 nrf_ce(IO_Pin::IO_Pin_Mode_OUT,SPI2_CE_GPIO_Port,SPI2_CE_Pin);
	IO_Pin_STM32 nrf_irqn(IO_Pin::IO_Pin_Mode_IN, SPI2_IRQN_GPIO_Port,SPI2_IRQN_Pin);
	SPI_STM32 spinrf(hspi2, nrf_nss);
	NRF24L01P nrf(spinrf,nrf_nss,nrf_ce,nrf_irqn);
	//  Robo robo(nrf,id);
	a=nrf.SelfTest();
	nrf.Init();
	nrf.Config(); // configurações : DPL OK, ACK OK, ACK_NOT OK, POWER UP OK
	nrf.StartRX_ESB(channel, address + id, 32, 1);
	nrf.TxPackage_ESB(channel, address + id, 0,(uint8_t*) "TESTE", 5);
	while(nrf.Busy()){
		nrf.InterruptCallback();
	}
	nrf.StartRX_ESB(channel, address + id, 32, 1);
	////////////////////////////////////////////




	//TESTE

	//  a=nrf.SelfTest();
	//  nrf.TxReady();
	//  a=nrf.SelfTest();


	for(;;)/*Não entendi direito*/
	{
		//    osDelay(500);
		//  HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
		nrf.InterruptCallback();
		if(nrf.RxSize()){
			interruptReceive(&nrf);
			//robo.interruptAckPayload();
			last_packet_ms = GetLocalTime();
			controlbit = true;
		}
		if((GetLocalTime()-last_packet_ms)>100){
			controlbit = false;
		}
		/////
	}
	/* USER CODE END 5 */
}


void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){

	static int16_t m0p=0, m1p=0,old_c0=0,old_c1=0;

	//valor aproximado do raio da roda, em metros
	static const float R_roda = 0.030;
	static const float PI = 3.1415926;
	//valor do tempo em segundos
	static const float Tempo = 0.013;
	//número de divisões do encoder
	static const float ENC_DIV = 20;
	//para cada 75 giros do motor, a roda gira 1 vez
	static const float RED = 75;
	static float CALCULO = 0.0f;
	if(CALCULO==0.0f) CALCULO=(2*PI*R_roda/(Tempo*ENC_DIV*RED));
	static float speed_m0= 0.0f;
	static float speed_m1= 0.0f;
	static float e_m0 =0.0f,e_m1=0.0f;
	static float pwm_m0 =0.0f,pwm_m1=0.0f;
	//controle
	int16_t hist_m0p[13], hist_m1p[13];
	int j=0;
	float kp = 56000.0f;
	float ki=70.0f;
	float kp = 7000.0f;
	float ierror_m0=0.0f;
	float ierror_m1=0.0f;
	float last_error_m0[20];
	float last_error_m1[20];
	float derror_m0=0.0f;
	float derror_m1=0.0f;
	//SPI
	static float dado;

	if(htim==&htim1){
		static uint8_t i=0;
		//motor 0
		//	estava assim antes	m0p=(int16_t)(htim2.Instance->CNT), acredito que esteja trocado;
		m0p=(int16_t)(htim4.Instance->CNT);

		//motor 1
		//	estava assim antes	m2p=(int16_t)(htim4.Instance->CNT), acredito que esteja trocado;
		m1p=(int16_t)(htim2.Instance->CNT);
		old_m0p = hist_m0p[i%13];
		old_m1p = hist_m1p[i%13];
		hist_m0p[i%13] = m0p;
		hist_m1p[i%13] = m1p;

		if(controlbit){
			if(i% 13==1){
				if(pwm_m0>=0.0f){
					HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_RESET);
				} else {
					HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_RESET);

				}

				if(pwm_m1>=0.0f){
					HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_RESET);
				} else {
					HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_SET);
					HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_RESET);
				}
			}
		} else {
			HAL_GPIO_WritePin(M0_MAH_GPIO_Port, M0_MAH_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(M0_MBH_GPIO_Port, M0_MBH_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(M1_MAH_GPIO_Port, M1_MAH_Pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(M1_MBH_GPIO_Port, M1_MBH_Pin, GPIO_PIN_SET);
		}


		//primeiro testa e depois incrementa
		//if(i++% 13==0){
			i=(i+1)%13;
			speed_m0= CALCULO*((int16_t)(m0p - old_m0p));
			speed_m1= CALCULO*((int16_t)(m1p - old_m1p));

			//motor 0
			e_m0= velocidade_des0-speed_m0;

			for(int j = 18; j > 0; j--){
				last_error_m0[j+1]=last_error_m0[j];
				ierror_m0 = ierror_m0 + last_error_m0[j+1];
			}
			last_error_m0[0]=e_m0;
			ierror_m0 = ierror_m0 + last_error_m0[0];
				//if(ierror > 1000) ierror = 1000;
				//if(ierror < -1000) ierror = -1000;
			derror_m0=e_m0-last_error_m0[1];

			pwm_m0 = kp*e_m0 + ki*ierror_m0 + kd*derror_m0;

			if(pwm_m0>1000.0f)
				pwm_m0=1000.0f;
			if(pwm_m0<-1000.0f)
				pwm_m0=-1000.0f;
			if(pwm_m0>=0.0f){
				htim1.Instance->CCR1=0;
				htim1.Instance->CCR2=(uint16_t)pwm_m0;
			} else {
				htim1.Instance->CCR1=(uint16_t)(-pwm_m0);
				htim1.Instance->CCR2=0;
			}

