roboime/STM32-F1-FreeRTOS/Src/main.cpp
			//motor 1
			e_m1= velocidade_des1-speed_m1;

			for(int j = 18; j > 0; j--){
				last_error_m1[j+1]=last_error_m1[j];
				ierror_m1 = ierror_m1 + last_error_m1[j+1];
			}
			last_error_m1[0]=e_m1;
			ierror_m1 = ierror_m1 + last_error_m1[0];

			derror_m1=e_m1-last_error_m1[1];

			pwm_m1 = kp*e_m1 + ki*ierror_m1 + kd*derror_m1;

			if(pwm_m1>1000.0f)
				pwm_m1=1000.0f;
			if(pwm_m1<-1000.0f)
				pwm_m1=-1000.0f;
			if(pwm_m1>=0.0f){
				htim3.Instance->CCR3=0;
				htim3.Instance->CCR4=(uint16_t)pwm_m1;
			} else {
				htim3.Instance->CCR3=(uint16_t)(-pwm_m1);
				htim3.Instance->CCR4=0;
			}

			//old_c0=m0p;
			//old_c1=m1p;
		}

//	}
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  Noneb
 * @retval None
 */
void _Error_Handler(char * file, int line)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while(1)
	{
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT

/**
 * @brief Reports the name of the source file and the source line number
 * where the assert_param error has occurred.
 * @param file: pointer to the source file name
 * @param line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */

}

#endif

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
